const essentialDuas = [
    {
        "id": "laylatul",
        "badge": "Laylatul Qadr",
        "arabic": "اللَّهُمَّ إِنَّكَ عَفُوٌّ تُحِبُّ الْعَفْوَ فَاعْفُ عَنِّي",
        "english": "O Allah, You are Forgiving and love forgiveness, so forgive me"
    },
    {
        "id": "istighfar",
        "badge": "Sayyidul Istighfar",
        "arabic": "اللَّهُمَّ أَنْتَ رَبِّي لاَ إِلَهَ إِلاَّ أَنْتَ، خَلَقْتَنِي وَأَنَا عَبْدُكَ، وَأَنَا عَلَى عَهْدِكَ وَوَعْدِكَ مَا اسْتَطَعْتُ، أَعُوذُ بِكَ مِنْ شَرِّ مَا صَنَعْتُ، أَبُوءُ لَكَ بِنِعْمَتِكَ عَلَيَّ، وَأَبُوءُ لَكَ بِذَنْبِي فَاغْفِرْ لِي، فَإِنَّهُ لاَ يَغْفِرُ الذُّنُوبَ إِلاَّ أَنْتَ",
        "english": "O Allah, You are my Lord, there is no deity except You. You created me and I am Your servant, and I am keeping my promise and covenant to You as much as I can. I seek refuge in You from the evil of what I have done. I acknowledge Your blessing upon me, and I acknowledge my sin, so forgive me, for there is none who can forgive sins except You."
    },
    {
        "id": "goodness",
        "badge": "Good in both worlds",
        "arabic": "رَبَّنَا آتِنَا فِي الدُّنْيَا حَسَنَةً وَفِي الآخِرَةِ حَسَنَةً وَقِنَا عَذَابَ النَّارِ",
        "english": "Our Lord, give us in this world [that which is] good and in the Hereafter [that which is] good and protect us from the punishment of the Fire."
    },
    {
        "id": "parents",
        "badge": "For Parents",
        "arabic": "رَبِّ ارْحَمْهُمَا كَمَا رَبَّيَانِي صَغِيرًا",
        "english": "My Lord, have mercy upon them as they brought me up [when I was] small."
    },
    {
        "id": "guidance",
        "badge": "For Guidance",
        "arabic": "اللَّهُمَّ إِنِّي أَسْأَلُكَ الْهُدَى وَالتُّقَى وَالْعَفَافَ وَالْغِنَى",
        "english": "O Allah, I ask You for guidance, piety, chastity, and self-sufficiency."
    },
    {
        "id": "beforefast",
        "badge": "Breaking Fast / Iftar",
        "arabic": "اللَّهُمَّ إِنِّي لَكَ صُمْتُ، وَبِكَ آمَنْتُ، وَعَلَيْكَ تَوَكَّلْتُ، وَعَلَى رِزْقِكَ أَفْطَرْتُ",
        "english": "O Allah, for You I have fasted, in You I believe, upon You I rely, and with Your provision I have broken my fast."
    },
    {
        "id": "deeds",
        "badge": "Acceptance of Deeds",
        "arabic": "رَبَّنَا تَقَبَّلْ مِنَّا ۖ إِنَّكَ أَنتَ السَّمِيعُ الْعَلِيمُ",
        "english": "Our Lord, accept [this] from us. Indeed You are the Hearing, the Knowing."
    }
];

const jawamiDuas = [
    {
        "id": "j_1",
        "badge": "Jawami' Dua 1",
        "arabic": "اللَّهُمَّ يَا بَارِئَ البَرِيَّاتِ ، وَغَافِرَ الخَـطِيَّاتِ ، وَعَالِمَ الخَفِيَّاتِ ، المُطَّلِعُ عَلَى الضَّمَائِرِ وَالنِّيَّاتِ ،",
        "english": ""
    },
    {
        "id": "j_2",
        "badge": "Jawami' Dua 2",
        "arabic": "يَا مَنْ أَحَاطَ بِكُلِّ شَيءٍ عِلْماً ، وَوَسِعَ كُلّ شَيْءٍ رَحْمَةً ، وَقَهَرَ كُلّ مَخْلُوقٍ عِزَّةً وَحُكْماً ، اغْفِرْ لِي ذُنُوبِي ، وَاسْتُرْ عُيُوبِيَ ، وَتَجَاوَزْ عَنْ سَيِّئَاتِيَ إِنَّكَ أَنْتَ الْغَفُورُ الرَّحِيمُ.",
        "english": ""
    },
    {
        "id": "j_3",
        "badge": "Jawami' Dua 3",
        "arabic": "اللَّهُمَّ يَا سَمِيعَ الدَّعَوَاتِ ، يَا مُقِيلَ العَثَرَاتِ ، يَاقَاضِيَ الحَاجَاتِ ، يَا كَاشِفَ الكَرُبَاتِ ، يَا رَفِيعَ الدَّرَجَاتِ ، وَيَا غَافِرَ الزَّلاَّتِ ، اغْفِرْ لِلْمُسْلِمِينَ وَالمُسْلِمَاتِ ، وَالمُؤْمِنِينَ وَالمُؤْمِنَاتِ، الأحْيَاءِ مِنْهُم وَالأمْوَاتِ ، إِنَّكَ سَمِيعٌ قَرِيبٌ مُجِيبُ الدَّعَوَاتِ.",
        "english": ""
    },
    {
        "id": "j_4",
        "badge": "Jawami' Dua 4",
        "arabic": "اللَّهُمَّ إِنِّي أَسْأَلُكَ بِاسْمِكَ الأَعْظَمِ ، الَّذِي إِذَا دُعِيتَ بِهِ أَجَبْتَ ، وَإِذَا سُئِلْتَ بِهِ أَعْطَـيْتَ ، أَسْأَلُكَ بِأَنِّي أَشُهَدُ أَنَّكَ أَنْتَ اللهُ لا إِلَهَ إِلاَّ أَنْتَ ، الأَحَدُ الصَّمَدُ ، الَّذِي لَمْ يَلِدْ، وَلَمْ يَولَدْ ، وَلَمْ يَكُنْ لَهُ كُفُوًا أَحَدٌ ؛ أَنْ تَغْفِرَ لِي ذُنُوبِي ، إِنَّكَ أَنْتَ الغَفُورُ الرَّحِيمُ.",
        "english": ""
    },
    {
        "id": "j_5",
        "badge": "Jawami' Dua 5",
        "arabic": "اللَّهُمَّ إِنَّكَ عَفُوٌّ كَرِيمٌ تُحِبُّ العّفْوَ فَاعْفُ عَنِّي.",
        "english": ""
    },
    {
        "id": "j_6",
        "badge": "Jawami' Dua 6",
        "arabic": "اللَّهُمَّ رَبِّ اغْفِرْ لِي وَلِوَالِدَيَّ وَلِمَنْ دَخَلَ بَيْتِيَ مُؤْمِنًا وَلِلْمُؤْمِنِينَ وَالمُؤْمِنَاتِ.",
        "english": ""
    },
    {
        "id": "j_7",
        "badge": "Jawami' Dua 7",
        "arabic": "اللَّهُمَّ اغْفِرْ لِي خَطِيئَتِي وَجَهْلِي ، وَإِسْرَافِي فِي أَمْرِي ، وَمَا أَنْتَ أَعْـلَمُ بِهِ مِنّـِي ، اللَّهُمَّ اغْفِرْ لِي هَزْلِي وَجِدِّي ، وَخَطَئِي وَعَمْدِي ، وَكُلُّ ذَلِكَ عِنْدِي.",
        "english": ""
    },
    {
        "id": "j_8",
        "badge": "Jawami' Dua 8",
        "arabic": "اللَّهُمَّ رَبِّ إِنِّي ظَلَمْتُ نَفْسِي فَاغْفِرْ لِي.",
        "english": ""
    },
    {
        "id": "j_9",
        "badge": "Jawami' Dua 9",
        "arabic": "اللَّهُمَّ أَنْتَ رَبِّي لا إِلَهَ إِلاَّ أَنْتَ خَلَقْتَنِي وَأَنَا عَبْدُكَ ، وَأَنَا عَلَى عَهْدِكَ وَوَعْدِكَ مَااسْتَطَعْتُ، أَعُوذُ بِكَ مِنْ شَرِّ مَا صَنَعْتُ أَبُوءُ لَكَ بِنِعْمَتِكَ عَلَيَّ وَأَبُوءُ لَكَ بِذَنْبِي فَاغْفِرْ لِي فَإنَّهُ لا يَغْفِرُ الذُّنُوبَ إِلاَّ أَنْتَ.",
        "english": ""
    },
    {
        "id": "j_10",
        "badge": "Jawami' Dua 10",
        "arabic": "اللَّهُمَّ اغْفِرْ لِي ، وَارْحَمْنِي وَاهْدِنِي ، وَعَافِنِي وَارْزُقْنِي ، وَاجْبُرْنِي ، وَارْفَعْنِي.",
        "english": ""
    },
    {
        "id": "j_11",
        "badge": "Jawami' Dua 11",
        "arabic": "اللَّهُمَّ يَا مَنْ لا تَضُرُّهُ الذُّنُوبُ ، وَلا تُنْقِصُهُ المَغْفِرَةُ ، اغْفِرْ لَنَا مَا لا يَضُرُّكَ ، وَهَبْ لَنَا مَالا يُنْقِصُكَ.",
        "english": ""
    },
    {
        "id": "j_12",
        "badge": "Jawami' Dua 12",
        "arabic": "اللَّهُمَّ اغْفِرْ لِي ذَنْبِي كُلّهُ ، دِقَّهُ وَجُلَّهُ ، وَأَوَّلَهُ وَآخِرَهَ ، وَعَلاَنِيَتَهَ وَسِرَّهُ.",
        "english": ""
    },
    {
        "id": "j_13",
        "badge": "Jawami' Dua 13",
        "arabic": "اللَّهُمَّ إِنَّ ذُنُوبِي عِظَامٌ وَهِي صِغَارٌ فِي جَنْبِ عَفْوِكَ يَا كَرِيمُ ، فَاغْفِرْهَا لِي.",
        "english": ""
    },
    {
        "id": "j_14",
        "badge": "Jawami' Dua 14",
        "arabic": "اللَّهُمَّ اغْفِرْ لِي ذَنْبِي ، وَوَسِّعْ لِي فِي دَارِي ، وَبَارِكْ لِي فِي رِزْقِي.",
        "english": ""
    },
    {
        "id": "j_15",
        "badge": "Jawami' Dua 15",
        "arabic": "اللَّهُمَّ رَبَّنَا لا تُؤَاخِذْنَا إِنْ نَسِينَا أَوْ أَخْطَأْنَا ، رَبَّنَا وَلا تَحْمِلْ عَلَينَا إِصْرَاً كَمَا حَمَلْتَهَ عَلَى الَّذِينَ مِنْ قَبْلِنَا ، رَبَّنَا وَلا تُحَمِّلْنَا مَا لا طَاقَةَ لَنَا بِهِ ، وَاعْفُ عَنَّا وّاغْفِرْ لَنَا وَارْحَمْنَا أَنْتَ مَوْلانَا فَانْصُرْنَا عَلَى القَوْمِ الكَافِرِينَ.",
        "english": ""
    },
    {
        "id": "j_16",
        "badge": "Jawami' Dua 16",
        "arabic": "اللَّهُمَّ إِنَّا قَدْ أَطَعْنَاكَ فِي أَحَبِّ الأشْيَاءِ إِلَيْكَ أَنْ تُطَاعَ فِيْهِ ، الإيمَانِ بِكَ ، وَالإِقْرَارِ بِكَ ، وَلَمْ نَعْصِكَ فِي أَبْغَضِ الأَشْيَاءِ أَنْ تُعْصَى فِيْهِ ؛ الكُفْرِ وَالجَحْدِ بِكَ ،",
        "english": ""
    },
    {
        "id": "j_17",
        "badge": "Jawami' Dua 17",
        "arabic": "اللَّهُمَّ فَاغْفِرْ لَنَا مَا بَيْنَهُمَا.",
        "english": ""
    },
    {
        "id": "j_18",
        "badge": "Jawami' Dua 18",
        "arabic": "اللَّهُمَّ اغْفِرْ لِي مَا قَدَّمْتُ وَمَا أَخَّرْتُ ، وَمَا أَعْلَنْتُ وَمَا أَسْرَرْتُ ، وما أنت أعلم به مني ، أَنْتَ المُقَدِّمُ وَأَنْتَ المُؤَخِّرُ لا إِلَهَ إِلاَّ أَنْـتَ.",
        "english": ""
    },
    {
        "id": "j_19",
        "badge": "Jawami' Dua 19",
        "arabic": "اللَّهُمَّ رَبَّنَا اغْفِرْ لَنَا ذُنُوبَنَا وَكَفِّرْ عَنَّا سَيِّئَاتِنَا وَتَوَفَّنَا مَعَ الأَبْرَارِ.",
        "english": ""
    },
    {
        "id": "j_20",
        "badge": "Jawami' Dua 20",
        "arabic": "اللَّهُمَّ رَبَّنَا اغْفِرْ لَنَا وَلإخْوَانِنَا الَّذِينَ سَبَقُونَا بِالإِيْمَانِ ، رَبَّنَا وَسِعْتَ كُلّ شَيءٍ رَحْمَةً وَعِلْماً فَاغْفِرْ لِلَّذِينَ تَابُوا وَاتَّبَعُوا سَبِيلَكَ وَقِهِمْ عَذَاب الجَحِيمِ.",
        "english": ""
    },
    {
        "id": "j_21",
        "badge": "Jawami' Dua 21",
        "arabic": "اللَّهُمَّ أَقِلْ عَثَرَاتِنَا ، وَاغْفِرْ زَلاَّتِنَا ، وَكَفِّرْ عَنَّا سَيِّئَاتِنَا ، وَتَوَفَّنَا مَعَ الأَبْرَارِ.",
        "english": ""
    },
    {
        "id": "j_22",
        "badge": "Jawami' Dua 22",
        "arabic": "اللَّهُمَّ بَاعِدْ بَيْنِي وَبَينَ خَطَايَايَ كَمَا بَاعَدْتَ بَيْنَ المَشْرِقِ وَالمَغْرِبْ ، اللَّهُمَّ اغْسِلْنِي مِنْ خَطَايَايَ بِالمَاءِ وَالثَّلْجِ وَالبَرَدِ ،",
        "english": ""
    },
    {
        "id": "j_23",
        "badge": "Jawami' Dua 23",
        "arabic": "اللَّهُمَّ نَقِّنِي مِنْ الخَطَايَا كَمَا يُنَقَّى الثَّوبُ الأَبْيَضُ مِـنَ الدَّنَسِ.",
        "english": ""
    },
    {
        "id": "j_24",
        "badge": "Jawami' Dua 24",
        "arabic": "اللَّهُمَّ إِنِّي ظَلَمْتُ نَفْسِي ظلْماً كَثِيراً ، وَلا يَغْفِرُ الذُّنُوب إِلاَّ أَنْتَ. فَاغْفِرْ لِي مَغْفِرَةً مِنْ عِنْدَكَ ، وَارْحَمْنِي إِنَّكَ أَنْتَ الغَفُورُ الرَّحِيمُ.",
        "english": ""
    },
    {
        "id": "j_25",
        "badge": "Jawami' Dua 25",
        "arabic": "اللَّهُمَّ إِنِّي أَسْأَلُكَ يَا اللهُ بِأَنَّكَ الوَاحِدُ الأَحَدُ ، الصَّمَدُ ، الَّذِي لَمْ يَلِدْ وَلَمْ يُولَدْ وَلَمْ يَكُنْ لَهُ كُفُواً أَحَدٌ ، أَنْ تَغْفِرَ لِي ذُنُـوبِي ، إِنَّكَ أَنْتَ الغَفُورُ الرَّحِيمُ.",
        "english": ""
    },
    {
        "id": "j_26",
        "badge": "Jawami' Dua 26",
        "arabic": "اللَّهُمَّ إِلَهِي : حُجَّتِي حَاجَتِي ، وَعُدَّتِي فَاقَتِي ، فَارْحَمْنِي.",
        "english": ""
    },
    {
        "id": "j_27",
        "badge": "Jawami' Dua 27",
        "arabic": "اللَّهُمَّ إِلَهِي : كَيْفَ أمْتَنِعُ بِالذَّنْبِ مِنَ الدُّعَاءِ ، وَلا أَرَاكَ تَمْنَعُ مَعَ الذَّنْبِ مِنَ العَطَاءِ ، فَإِنْ غَفَرْتَ فَخَيرُ رَاحِمٍ أَنْتَ ، وَإِنْ عَذَّبْتَ فَغَيْرُ ظَالِمٍ أَنْتَ.",
        "english": ""
    },
    {
        "id": "j_28",
        "badge": "Jawami' Dua 28",
        "arabic": "اللَّهُمَّ إِلَهِي: أَسْأَلُكَ تَذَلُّلاً فَأَعْطِنِي تَفَضُّلاً.",
        "english": ""
    },
    {
        "id": "j_29",
        "badge": "Jawami' Dua 29",
        "arabic": "اللَّهُمَّ يَامَنْ عَلَى العَرْشِ اسْتَوَى ، يَامَنْ خَلَقَ فَسَوَّى وَقدَّرَ فَهَدَى ، وَأَعْطَى كُلّ شَيءٍ خَلْقَهُ ثُمَّ هَدَى ، يَامَنْ أَضْحَكَ وَأَبْكَى، وَأَمَاتَ وَأَحْيَا ، وَأَسْعَدَ وَأَشْقَى ، وَأَوْجَدَ وَأَبْلَى ، وَرَفَعَ وَخَفَضَ ، وَأَعَزَّ وَأَذَلَّ، وَأَعْطَى وَمَنَعَ ، وَرَفَعَ وَوَضَعَ.",
        "english": ""
    },
    {
        "id": "j_30",
        "badge": "Jawami' Dua 30",
        "arabic": "اللَّهُمَّ يَا مَنْ شَقَّ البِحَارَ ، وَأَجْرَى الأَنْهَارَ ، وَكَوَّرَ النَّهَارَ عَلَى اللَّيلِ وَاللَّيلَ عَلَى النَّهَارِ ،",
        "english": ""
    },
    {
        "id": "j_31",
        "badge": "Jawami' Dua 31",
        "arabic": "يَا مَنْ هَدَى مِنْ ضَلالَةٍ ، وَأَنْقَذَ مِنْ جَهَالَةٍ ، وَأَنَارَ الأَبْصَارَ ، وَأَحْيَا الضَّمَائِرَ وَالأَفْكَارَ.",
        "english": ""
    },
    {
        "id": "j_32",
        "badge": "Jawami' Dua 32",
        "arabic": "اللَّهُمَّ اهْدِنَا فِيمَنْ هَدَيْتَ ، وَعَافِنَا فِيمَنْ عَافَيتَ ، وَتَوَلَّنَا فِيمَنْ تَوَلَّيْتَ.",
        "english": ""
    },
    {
        "id": "j_33",
        "badge": "Jawami' Dua 33",
        "arabic": "اللَّهُمَّ اهْدِنَا الصِّرَاطَ المُسْتَقِيمَ ، صِرَاطَ الَّذِينَ أَنْعَمْتَ عَلَيهِم مِنَ النَّبِيِّينَ وَالصِّدِّيقِينَ وَالشُّهَدَاءِ وَالصَّالِحِينَ.",
        "english": ""
    },
    {
        "id": "j_34",
        "badge": "Jawami' Dua 34",
        "arabic": "اللَّهُمَّ وَفِّقْنَا لِهُدَاكَ وَاجْعَلْ عَمَلَنَا فِي رِضَاكَ.",
        "english": ""
    },
    {
        "id": "j_35",
        "badge": "Jawami' Dua 35",
        "arabic": "اللَّهُمَّ أَرِنَا الحَقَّ حقَّاً وَارْزُقْنَا اتِّبَاعَهُ، وَأَرِنَا البَاطِلَ بَاطِلاً وَارْزُقْنَا اجْتِنَابَهُ.",
        "english": ""
    },
    {
        "id": "j_36",
        "badge": "Jawami' Dua 36",
        "arabic": "اللَّهُمَّ آتِ نَفْسِي تَقْوَاهَا ، وَزَكِّهَا أَنْتَ خَيْرُ مَنْ زَكَّاهَا، أَنْتَ وَلِيُّهَا وَمَوْلاهَا.",
        "english": ""
    },
    {
        "id": "j_37",
        "badge": "Jawami' Dua 37",
        "arabic": "اللَّهُمَّ رَبَّنَا أَتْمِمْ لَنَا نُورَنَا وَاغْفِرْ لَنَا إِنَّكَ عَلَى كُلّ شَيءٍ قَدِيرٌ.",
        "english": ""
    },
    {
        "id": "j_38",
        "badge": "Jawami' Dua 38",
        "arabic": "اللَّهُمَّ حَبِّبْ إلَينَا الإيمَانَ وَزَيِّنْهُ فِي قُلُوبِنَا ، وَكَرِّهِ إلَينَا الكُفْرَ وَالفُسُوقَ وَالعِصْيَانِ ، وَاجْعَلْنَا مِنَ الرَّاشِدِينَ.",
        "english": ""
    },
    {
        "id": "j_39",
        "badge": "Jawami' Dua 39",
        "arabic": "اللَّهُمَّ مُصَرِّفَ القُلُوبِ صَرِّفْ قُلُوبَنَا عَلَى طَاعَتِكَ.",
        "english": ""
    },
    {
        "id": "j_40",
        "badge": "Jawami' Dua 40",
        "arabic": "اللَّهُمَّ خُذْ بِنَوَاصِينَا لِِلْبِرِّ وَالتَّقْوَى ، وَلِمَا تُحِبُّ مِنَ العَمَلِ وَتَرْضَى.",
        "english": ""
    },
    {
        "id": "j_41",
        "badge": "Jawami' Dua 41",
        "arabic": "اللَّهُمَّ رَبِّ جِبْرَائِيلَ وَمِيكَائِيلَ ، وَإسْرَافِيلَ ، فَاطِرَ السَّمَاوَاتِ وَالأَرْضَ ، عَالِمَ الغَيْبِ وَالشَّهَادَةِ ، أَنْتَ تَحْكُمُ بَيْنَ عِبَادِكَ فِيمَا كَانُوا فِيْهِ يَخْتَلِفُونَ ، اهْدِنَا لِمَا اخْتُلِفَ فِيْهِ مِنَ الحَقِّ بِإذْنِكَ ، إِنَّكَ تَهْدِي مَنْ تَشَاءُ إِلَى صِرَاطٍ مُسْتَقِيمٍ.",
        "english": ""
    },
    {
        "id": "j_42",
        "badge": "Jawami' Dua 42",
        "arabic": "اللَّهُمَّ إِنِّي عَبْدُكَ ابْنُ عَبْدِكَ ابْنُ أَمَتِكَ ، نَاصِيَتِي بِيَدِكَ ، مَاضٍ فِيَّ حُكْمُكَ ، عَدْلٌ فِيَّ قَضَاؤكَ ، أَسْأَلُكَ بِكلِّ اسْمٍ هُوَ لَكَ ، سَمَّيتَ بِهِ نَفْسَكَ ، أَوْ أَنْزَلْتَهُ فِي كِتَابِكَ ، أَوْ عَلَّمْتَهُ أَحَداً مِنْ خَلْقِكَ ، أَوْ اسْتَأْثَرْتَ بِهِ فِي عِلْمِ الغَيبِ عِنْدَكَ ، أَنْ تَجْعَلَ القُرْآنَ رَبِيعَ قَلْبِي ، وَنُورَ صَدْرِي ، وَجَلاءَ حَزَنِي ، وَذَهَابَ هَمِّي.",
        "english": ""
    },
    {
        "id": "j_43",
        "badge": "Jawami' Dua 43",
        "arabic": "اللَّهُمَّ اجْعَلْ فِي قَلْبِي نُوراً ، وَفِي سَمْعِي نُوراً ، وَفِي بَصَرِي نُوراً ، وَعَنْ يَمِينِي نُوراً ، وَعَنْ شِمَالِي نُوراً ، وَمِنْ بَيْنَ يَدَيَّ نُوراً ، وَمِنْ خَلْفِي نُوراً ، وَمِنْ فَوقِي نُوراً ، وَمِنْ تَحْتِي نُوراً ، وَاجْعَلْ لِي نُوراً ، وَأَعْظِمْ لِي نُوراً.",
        "english": ""
    },
    {
        "id": "j_44",
        "badge": "Jawami' Dua 44",
        "arabic": "اللَّهُمَّ أَغْنِنِي بِالعِلْمِ ، وَزَيِّنِّي بِالحِلْمِ ، وَأَكْرِمْنِي بِالتَّقْوَى ، وَجَمِّلْنِي بِالعَافِيَةِ.",
        "english": ""
    },
    {
        "id": "j_45",
        "badge": "Jawami' Dua 45",
        "arabic": "اللَّهُمَّ إِنِّي أَسْأَلُكَ عِلْمَ الخَائِفِينَ مِنْكَ ، وَخَوفَ العَالِمِينَ بِكَ ، وَيَقِينَ المُتَوَكِّلِينَ عَلَـيْكَ ، وَتَوَكُّلَ المُوقِنِينَ بِكَ ، وَإِنَابَةَ المُخْبِتِينَ إِلَيْكَ ، وَإِخْبَاتَ المُنِيبينَ إِلَيْكَ ، وَشُكْرَ الصَّابِرِينَ لَكَ ، وَصَبْرَ الشَّاكِـرِينَ لَكَ ، وَللحَاقاً بِالأَحْيَاءِ المَرْزُوقِينَ عِنْدَكَ.",
        "english": ""
    },
    {
        "id": "j_46",
        "badge": "Jawami' Dua 46",
        "arabic": "اللَّهُمَّ اهْدِنِي وَسَدِّدْنِي ، اللَّهُمَّ إِنِّي أَسْأَلُكَ الهُدَى وَالسَّدَادَ.",
        "english": ""
    },
    {
        "id": "j_47",
        "badge": "Jawami' Dua 47",
        "arabic": "اللَّهُمَّ أَلْهِمْنِي رُشْدِي ، وَأَعِذْنِي مِنْ شَرِّ نَفْسِي.",
        "english": ""
    },
    {
        "id": "j_48",
        "badge": "Jawami' Dua 48",
        "arabic": "اللَّهُمَّ انْفَعْنِي بِمَا عَلَّمْتَنِي ، وَعَلِّمْنِي مَا يَنْفَعُنِي ، وَزِدْنِي عِلْماً.",
        "english": ""
    },
    {
        "id": "j_49",
        "badge": "Jawami' Dua 49",
        "arabic": "اللَّهُمَّ إِنِّي أَسْأَلُكَ عِلْماً نَافِعاً ، وَأَعُوذُ بِكَ مِنْ عِلْمٍ لا يَنْفَعُ.",
        "english": ""
    },
    {
        "id": "j_50",
        "badge": "Jawami' Dua 50",
        "arabic": "اللَّهُمَّ ثَبِّتْنِي وَاجْعَلْنِي هَادِياً مَهْدِيّاً.",
        "english": ""
    },
    {
        "id": "j_51",
        "badge": "Jawami' Dua 51",
        "arabic": "اللَّهُمَّ لَكَ أَسْلَمْتُ ، وَبِكَ آمَنْتُ ، وَعَلَيكَ تَوَكَّلْتُ ، وَإِلَيكَ أَنَبْتُ ، وَبِكَ خَاصَمْتُ، أَعُوذُ بِعِزَّتِكَ ، لا إِلَهَ إِلاَّ أَنْتَ ، أَنْ تُضِلَّنِي ، أَنْتَ الحَيُّ الَّذِي لا يَمُوتُ ، وَالجِنُّ وَالإنْسُ يَمُوتُونَ.",
        "english": ""
    },
    {
        "id": "j_52",
        "badge": "Jawami' Dua 52",
        "arabic": "اللَّهُمَّ اهْدِنِي لأَحْسَنِ الأَخْلاَقِ لا يَهْدِي لأَحْسَنِهَا إِلاَّ أَنْتَ ، وَاصْرِفْ عَنِّي سَيِّئَها لا يَصْرِفُ عَنِّي سَيِّئَهَا إِلاَّ أَنْتَ.",
        "english": ""
    },
    {
        "id": "j_53",
        "badge": "Jawami' Dua 53",
        "arabic": "اللَّهُمَّ كَمَا أَحْسَنْتَ خَلْقِي فَأَحْسِنْ خُلُقِي.",
        "english": ""
    },
    {
        "id": "j_54",
        "badge": "Jawami' Dua 54",
        "arabic": "اللَّهُمَّ فَالِقَ الحَبِّ وَالنَّوَى ، وَمُخْرِجَ الحَيِّ مِنَ المَيِّتِ وَمُخْرِجَ المَيِّتِ مِنَ الحَيِّ ، فَالِقَ الإِصْبَاحِ ، وَجَاعِلَ اللَّيلِ سَكَناً ، وَالشَّمْسَ والقَمَرَ حُسْبَاناً ،",
        "english": ""
    },
    {
        "id": "j_55",
        "badge": "Jawami' Dua 55",
        "arabic": "يَا مَنْ جَعَلَ لَنَا النُّجُومَ لِنَهْتَدِيَ بِهَا فِي ظُلُمَاتِ الْبَرِّ وَالبَحْرِ.",
        "english": ""
    },
    {
        "id": "j_56",
        "badge": "Jawami' Dua 56",
        "arabic": "اللَّهُمَّ جَلَّتْ قُدْرَتُكَ ، وَتَعَالَتْ حِكْمَتُكَ ، وَتَبَارَكَ اسْمُكَ ، وَتَعَالَى جَدُّكَ ، وَلا إِلَهَ غَيْرُكَ.",
        "english": ""
    },
    {
        "id": "j_57",
        "badge": "Jawami' Dua 57",
        "arabic": "اللَّهُمَّ إِنِّي أَسْأَلُكَ بِأَنَّ لَكَ الحَمْدَ ، لا إِلَهَ إِلاَّ أَنْتَ ، المَنَّانُ ، بَدِيعُ السَّمَاوَات وَالأَرْضِ، ذُو الجَلالِ وَالإِكْرَامِ ، يَا حَيُّ يَا قَيُّومُ.",
        "english": ""
    },
    {
        "id": "j_58",
        "badge": "Jawami' Dua 58",
        "arabic": "اللَّهُمَّ ارْزُقْنَا رِزْقًا يَزِيدُنَا لَكَ شُكْراً ، وَإِلَيكَ فَاقَةً وَفَقْراً ، وَبِكَ عَمَّنْ سِوَاكَ غِنىً.",
        "english": ""
    },
    {
        "id": "j_59",
        "badge": "Jawami' Dua 59",
        "arabic": "اللَّهُمَّ اجْعَلْ أَوْسَعَ رِزْقِكَ عَلَيَّ عِنْدَ كِبَرِ سِنِّي ، وَانْقِطَاعِ عُمُرِي.",
        "english": ""
    },
    {
        "id": "j_60",
        "badge": "Jawami' Dua 60",
        "arabic": "اللَّهُمَّ إِنِّي أَسْأَلُكَ مِنْ فَضْلِكَ وَرَحْمَتِكَ فَإِنَّهُ لا يَمْلِكُهَا إِلاَّ أَنْتَ.",
        "english": ""
    },
    {
        "id": "j_61",
        "badge": "Jawami' Dua 61",
        "arabic": "اللَّهُمَّ رَبِّ لا تَذَرْنِي فَرْداً وَأَنْتَ خَيْرُ الْوَارِثِينَ.",
        "english": ""
    },
    {
        "id": "j_62",
        "badge": "Jawami' Dua 62",
        "arabic": "اللَّهُمَّ رَبِّ هَبْ لِيْ مِنَ الصَّالِحِينَ.",
        "english": ""
    },
    {
        "id": "j_63",
        "badge": "Jawami' Dua 63",
        "arabic": "اللَّهُمَّ قَنِّعْنِي بِمَا رَزَقْتَنِي ، وَبَارِكْ لِي فِيْهِ ، وَاخْلُفْ عَلَيَّ كُلّ غَائِبَةٍ لِي مِنْكَ بِخَيرٍ.",
        "english": ""
    },
    {
        "id": "j_64",
        "badge": "Jawami' Dua 64",
        "arabic": "اللَّهُمَّ رَبَّنَا هَبْ لَنَا مِنْ أَزْوَاجِنَا وَذُرِّيَّاتِنَا قُرَّة أَعْيُنٍ وَاجْعَلْنَا لِلْمُتَّقِينَ إِمَاماً.",
        "english": ""
    },
    {
        "id": "j_65",
        "badge": "Jawami' Dua 65",
        "arabic": "اللَّهُمَّ",
        "english": ""
    },
    {
        "id": "j_66",
        "badge": "Jawami' Dua 66",
        "arabic": "يَا مَنْ تُسَبِّحُ لَهُ السَّمَاوَاتُ بِنُجُومِهَا وَأَبْرَاجِهَا ، وَالأَرْضُ بِسُهُولِـــهَا وَفِجَاجِهَا ، وَالبِحَارُ بِأَحْيَائِهَا وَأَمْوَاجِهَا ، وَالجِبَالُ بِقِمَمِهَا وَأَوْتَادِهَا ، وَالأَشْجَارُ بِفُرُوعِهَا وَثِمَارِهَا ، وَالسِّبَاعُ فِي فَلَوَاتِهَا ، وَالطَّيْرُ فِي وَكَنَاتِهَا ،",
        "english": ""
    },
    {
        "id": "j_67",
        "badge": "Jawami' Dua 67",
        "arabic": "يَا مَنْ تُسَبِّحُ لَهُ الذَّرَّاتُ عَلَى صِغََرِهَا ، وَالمَجَرَّاتُ عَلَى كِبَرِهَـا ،",
        "english": ""
    },
    {
        "id": "j_68",
        "badge": "Jawami' Dua 68",
        "arabic": "يَا مَنْ تُسَبِّحُ لَهُ السَّمَاوَاتُ السَّبْعُ وَالأَرْضُ وَمَنْ فِيهِنَّ ، وِإنْ مِنْ شَيءٍ إِلاَّ يُسَبِّحُ بِحَمْدِه.",
        "english": ""
    },
    {
        "id": "j_69",
        "badge": "Jawami' Dua 69",
        "arabic": "اللَّهُمَّ يَا مَنْ خَلَقَ الأَرْضَ وَالسَّمَاوَاتِ العُلَى ، يَا رَحْمَاناً عَلَى العَرْشِ اسْتَوَى ، يَا مَنْ لَهُ مَا فِي السَّمَاوَات وَمَا فِي الأَرْضِ وَمَا بَيْنَهُمَا ، وَمَا تَحْتَ الثَّرَى ،",
        "english": ""
    },
    {
        "id": "j_70",
        "badge": "Jawami' Dua 70",
        "arabic": "يَا مَنْ يَعْلَمُ السِّرَ وَأَخْفَى، يَا مَنْ لَهُ الأَسْمَاءُ الحُسْنَى ، يَا مَنْ مَعَ عِبَادِهِ يَسْمَعُ وَيَرَى ، يَا مَنْ أَعطَى كُلّ شَيءٍ خَلْقَهُ ثُمَّ هَدَى.",
        "english": ""
    },
    {
        "id": "j_71",
        "badge": "Jawami' Dua 71",
        "arabic": "اللَّهُمَّ أَنْتَ البَادِئُ بِالإِحْسَانِ مِنْ قَبْلِ تَوَجُّهِ العَابِدِينَ ، وَأَنْتَ البَادِئُ بِالعَطَايَا قَبْلَ طَلَبِ الطَّالِبِينَ وَأَنْتَ الوَهَّابُ.",
        "english": ""
    },
    {
        "id": "j_72",
        "badge": "Jawami' Dua 72",
        "arabic": "اللَّهُمَّ إِنِّي أَسْأَلُكَ الجَنَّة وَمَا قَرَّبَ إِلَيْهَا مِنْ قَوْلٍ وَعَمَلٍ ، وَأَعُوذُ بِكَ مَنَ النَّارِ وَمَا قَرَّبَ إِلَيْهَا مِنْ قَوْلٍ وَعَمَلٍ.",
        "english": ""
    },
    {
        "id": "j_73",
        "badge": "Jawami' Dua 73",
        "arabic": "اللَّهُمَّ رَبِّ ابْنِ لِي عِنْدَكَ بَيْتاً فِي الجَنَّةِ.",
        "english": ""
    },
    {
        "id": "j_74",
        "badge": "Jawami' Dua 74",
        "arabic": "اللَّهُمَّ إِنِّي أَسْأَلُكَ رِضَاكَ وَالجَنَّةَ ، وَأَعُوذُ بِكَ مِنْ سَخَطِكَ وَالنَّارِ.",
        "english": ""
    },
    {
        "id": "j_75",
        "badge": "Jawami' Dua 75",
        "arabic": "اللَّهُمَّ أَحْسِنْ عَاقِبَتِنَا فِي الأُمُورِ كُلِّهَا ، وَأَجِرْنَا مِنْ خِزْيِ الدُّنْيَا وَعَذَابِ الآخِرَةِ.",
        "english": ""
    },
    {
        "id": "j_76",
        "badge": "Jawami' Dua 76",
        "arabic": "اللَّهُمَّ رَبَّنَا اصْرِفْ عَنَّا عَذَاب جَهَنَّم إِنَّ عَذَابَهَا كَانَ غَرَاماً.",
        "english": ""
    },
    {
        "id": "j_77",
        "badge": "Jawami' Dua 77",
        "arabic": "اللَّهُمَّ رَبَّنَا إِنَّنَا آمَنَّا فَاغْفِرْ لَنَا ذُنُوبَنَا وَقِنَا عَذَاب النَّارِ.",
        "english": ""
    },
    {
        "id": "j_78",
        "badge": "Jawami' Dua 78",
        "arabic": "اللَّهُمَّ إِنِّي أَسْأَلُكَ الجَنَّةَ ، وَأسْتَجِيرُ بِكَ مِنَ النَّارِ.",
        "english": ""
    },
    {
        "id": "j_79",
        "badge": "Jawami' Dua 79",
        "arabic": "اللَّهُمَّ رَبَّنَا وَآتِنَا مَا وَعَدْتَنَا عَلَى رُسِلِكَ وَلا تُخْزِنَا يَومَ القِيامَة إِنَّكَ لا تُخْلِفُ المِيعَادِ.",
        "english": ""
    },
    {
        "id": "j_80",
        "badge": "Jawami' Dua 80",
        "arabic": "اللَّهُمَّ حَاسِبْنِي حِسَاباً يَسِيراً.",
        "english": ""
    },
    {
        "id": "j_81",
        "badge": "Jawami' Dua 81",
        "arabic": "اللَّهُمَّ إِنَّا نَعُوذُ بِكَ أَنْ نُشْرِكَ بِكَ شَيْئاً نَعْلَمُهُ ، وَنَسْتَغْفِرُكَ لِمَا لا نَعْلَمُهُ.",
        "english": ""
    },
    {
        "id": "j_82",
        "badge": "Jawami' Dua 82",
        "arabic": "اللَّهُمَّ إنِّيْ أعُوذُ بِكَ مِنْ جَهْدِ البَلاء ، ودَرَكِ الشّــَقَاء ، وســوء القضاء ، وشَمَاتَة الأعْدَاء ، يَا سَمِيْع الدُّعَاء.",
        "english": ""
    },
    {
        "id": "j_83",
        "badge": "Jawami' Dua 83",
        "arabic": "اللَّهُمَّ إِنِّي أَعُوذُ بِكَ مِنْ عَذَابِ جَهَنَّمَ ، وَمِنْ عَذَابِ القَبْرِ ، وَمِنْ فِتْنَةِ المَحْيَا وَالمَمَـاتِ ، وَمِنْ فِتْنَةِ المَسِيحِ الدَّجَّالِ ،",
        "english": ""
    },
    {
        "id": "j_84",
        "badge": "Jawami' Dua 84",
        "arabic": "وَأَعُوذُ بِكَ مِنَ المَأْثَمِ وَالمَغْرَمِ.",
        "english": ""
    },
    {
        "id": "j_85",
        "badge": "Jawami' Dua 85",
        "arabic": "اللَّهُمَّ إِنِّي أَعُوذُ بِكَ مِنْ فِتْنَةِ النَّارِ وَعَذَابِ النَّارِ ، وَفِتْنَةِ القَبْرِ ، وَعَذَابِ القَبْرِ ، وَشَرِّ فِتْنَةِ الغِنَى ، وَشَرِّ فِتْنَةِ الفَقْرِ ،",
        "english": ""
    },
    {
        "id": "j_86",
        "badge": "Jawami' Dua 86",
        "arabic": "اللَّهُمَّ إِنِّي أَعُوذُ بِكَ مِنْ شَرِّ فِتْنَةِ المَسِيحِ الدَّجَّالِ.",
        "english": ""
    },
    {
        "id": "j_87",
        "badge": "Jawami' Dua 87",
        "arabic": "اللَّهُمَّ اغْسِلْ قَلْبِي بِمَاءِ الثَّلْجِ وَالْبَرَدِ ، وَنَقِّ قَلْبِيَ مِنْ الخَطَايَا كَمَا نَقَّيْتَ الثَّوْبَ الأَبْيَضَ مِنَ الدَّنَسِ ، وَبَاعِدْ بَيْنِي وَبيْنَ خَطَايَايَ كَمَا بَاعَدْتَ بَيْنَ المَشْرِقِ وَالمَغْرِبِ.",
        "english": ""
    },
    {
        "id": "j_88",
        "badge": "Jawami' Dua 88",
        "arabic": "اللَّهُمَّ إِنِّي أَعُوذُ بِكَ مِنَ الكَسَلِ وَالمَأْثَمِ وَالمَغْرَمِ.",
        "english": ""
    },
    {
        "id": "j_89",
        "badge": "Jawami' Dua 89",
        "arabic": "اللَّهُمَّ رَبِّ جِبْرَائِيلَ ، وَمِيكَائِيلَ ، وَرَبِّ إِسْرَافِيلَ ، أَعُوذُ بِكَ مِنْ حَرِّ النَّارِ وَمِنْ عَذَابِ القَبْرِ.",
        "english": ""
    },
    {
        "id": "j_90",
        "badge": "Jawami' Dua 90",
        "arabic": "اللَّهُمَّ إِنِّي أَعُوذُ بِكَ مِنْ جَارِ السُّوءِ فِي دَارِ المُقَامَةِ ، فَإِنَّ جَارَ البَادِيَةِ يَتَحَوَّلُ.",
        "english": ""
    },
    {
        "id": "j_91",
        "badge": "Jawami' Dua 91",
        "arabic": "اللَّهُمَّ إِنِّي أَعُوذُ بِكَ مِنَ العَجْزِ وَالكَسَلِ ، وَالجُبْنِ وَالبُخْلِ ، وَالهَرَمِ وَالقَسْوَةِ ، وَالغَفْلَةِ وَالعَيْلَةِ وَالذِّلَّةِ ، وَالمَسْكَنَةِ ،",
        "english": ""
    },
    {
        "id": "j_92",
        "badge": "Jawami' Dua 92",
        "arabic": "وَأَعُوذُ بِكَ مِنَ الفَقْرِ وَالكُفْرِ ، وَالفُسُوقِ وَالشِّقَاقِ وَالنِّفَاقِ، وَالسُّمْعَةِ وَالرِّيَاءِ ،",
        "english": ""
    },
    {
        "id": "j_93",
        "badge": "Jawami' Dua 93",
        "arabic": "وَأَعُوذُ بِكَ مِنَ الصَّمَمِ وَالبَكَمِ ، وَالجُنُونِ ، وَالجِذَامِ ، وَالبَرَصِ ، وَسَيِّئِ الأَسْقَامِ.",
        "english": ""
    }
];

const youssefDuas = [
    {
        "arabic": "اللَّهُمَّ اغْفِرْ لِيُوسُف عَبْدِ الْقَادِرِ وَارْحَمْهُ وَعَافِهِ وَاعْفُ عَنْهُ",
        "english": "O Allah, forgive Youssef Abdelkader, have mercy on him, pardon him, and grant him well-being"
    },
    {
        "arabic": "اللَّهُمَّ أَكْرِمْ نُزُلَهُ وَوَسِّعْ مُدْخَلَهُ وَاغْسِلْهُ بِالْمَاءِ وَالثَّلْجِ وَالْبَرَدِ",
        "english": "O Allah, be generous in his accommodation, make his entrance spacious, and wash him with water, snow, and hail"
    },
    {
        "arabic": "اللَّهُمَّ نَقِّهِ مِنَ الْخَطَايَا كَمَا نَقَّيْتَ الثَّوْبَ الْأَبْيَضَ مِنَ الدَّنَسِ",
        "english": "O Allah, cleanse him of sins as a white garment is cleansed of dirt"
    },
    {
        "arabic": "اللَّهُمَّ أَبْدِلْهُ دَارًا خَيْرًا مِنْ دَارِهِ وَأَهْلًا خَيْرًا مِنْ أَهْلِهِ",
        "english": "O Allah, grant him a home better than his home, and a family better than his family"
    },
    {
        "arabic": "اللَّهُمَّ أَدْخِلْهُ الْجَنَّةَ وَأَعِذْهُ مِنْ عَذَابِ الْقَبْرِ وَعَذَابِ النَّارِ",
        "english": "O Allah, admit him into Paradise and protect him from the punishment of the grave and the Fire"
    },
    {
        "arabic": "اللَّهُمَّ افْسَحْ لَهُ فِي قَبْرِهِ وَنَوِّرْ لَهُ فِيهِ",
        "english": "O Allah, make his grave spacious for him and fill it with light"
    },
    {
        "arabic": "اللَّهُمَّ اجْعَلْ قَبْرَهُ روْضَةً مِنْ رِيَاضِ الْجَنَّةِ وَلَا تَجْعَلْهُ حُفْرَةً مِنْ حُفَرِ النَّارِ",
        "english": "O Allah, make his grave a garden from the gardens of Paradise, and do not make it a pit from the pits of Hell"
    }
];